# المرحلة الأولى: استخدم خادم الويب Nginx كصورة أساسية
# Nginx هو خادم ويب خفيف وسريع ومثالي لخدمة المواقع الثابتة
FROM nginx:1.25.3-alpine

# قم بإزالة إعدادات Nginx الافتراضية
RUN rm /etc/nginx/conf.d/default.conf

# انسخ ملفات موقعك (كل المجلد الحالي) إلى المجلد الذي يخدم منه Nginx الملفات
COPY . /usr/share/nginx/html

# المنفذ الذي سيعمل عليه الخادم داخل الحاوية (Nginx يعمل على 80 افتراضياً)
EXPOSE 80

# الأمر الذي سيتم تشغيله عند بدء الحاوية (Nginx لديه أمر افتراضي، ولكن هذا للتأكيد)
CMD ["nginx", "-g", "daemon off;"]
